modm-ext/data.modm.io/docs/svd/header_stm32u5g9xx.svd
        <register>
          <name>HUFFENC_DC10</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC11</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC12</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC13</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC14</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC15</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC16</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HUFFENC_DC17</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>DMA2D Controller</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x4002b000</baseAddress>
      <interrupt>
        <name>DMA2D</name>
        <description>DMA2D global interrupt</description>
        <value>118</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>DMA2D Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend transfer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort transfer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIXELS</name>
                  <description>Line offsets are expressed in pixels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES</name>
                  <description>Line offsets are expressed in bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIE</name>
              <description>Transfer Watermark Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIE</name>
              <description>CLUT Access Error Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>CLUT Transfer Complete Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA2D Mode[2:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2M</name>
                  <description>DMA2D memory to memory transfer mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_PFC</name>
                  <description>DMA2D memory to memory with pixel format conversion transfer mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND</name>
                  <description>DMA2D memory to memory with blending transfer mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2M</name>
                  <description>DMA2D register to memory transfer mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND_FIXED_COLOR_FG</name>
                  <description>DMA2D memory to memory with blending transfer mode and fixed color foreground</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND_FIXED_COLOR_BG</name>
                  <description>DMA2D memory to memory with blending transfer mode and fixed color background</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>DMA2D Interrupt Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Transfer Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Transfer Complete Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIF</name>
              <description>Transfer Watermark Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIF</name>
              <description>CLUT Access Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>CLUT Transfer Complete Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIF</name>
              <description>Configuration Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>DMA2D Interrupt Flag Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Clears Transfer Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>Clears Transfer Complete Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTWIF</name>
              <description>Clears Transfer Watermark Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAECIF</name>
              <description>Clears CLUT Access Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>Clears CLUT Transfer Complete Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCEIF</name>
              <description>Clears Configuration Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMAR</name>
          <description>DMA2D Foreground Memory Address Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MA</name>
              <description>Foreground Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGOR</name>
          <description>DMA2D Foreground</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGMAR</name>
          <description>DMA2D Background Memory Address Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MA</name>
              <description>Background Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGOR</name>
          <description>DMA2D Background</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFCCR</name>
          <description>DMA2D Foreground PFC Control Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CM</name>
              <description>Input color mode CM[3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>ARGB8888</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>RGB888</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>RGB565</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB1555</name>
                  <description>ARGB1555</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB4444</name>
                  <description>ARGB4444</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L8</name>
                  <description>L8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AL44</name>
                  <description>AL44</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AL88</name>
                  <description>AL88</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L4</name>
                  <description>L4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8</name>
                  <description>A8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>A4</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCM</name>
              <description>CLUT Color mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>ARGB8888</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>RGB888</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode AM[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MODIF</name>
                  <description>No modification of the alpha channel value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMBINE</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSS</name>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSS_444</name>
                  <description>No chroma sub-sampling 4:4:4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSS_422</name>
                  <description>chroma sub-sampling 4:2:2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSS_420</name>
                  <description>chroma sub-sampling 4:2:0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AI</name>
              <description>Foreground Input Alpha Inverted</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>Regular alpha</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>Inverted alpha</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBS</name>
              <description>Foreground Input Red Blue Swap</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>RGB or ARGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP</name>
                  <description>BGR or ABGR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCOLR</name>
          <description>DMA2D Foreground Color Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BLUE</name>
              <description>Foreground Blue Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>Foreground Green Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>Foreground Red Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
