modm-ext/data.modm.io/docs/svd/header_stm32u5g9xx.svd
        <register>
          <name>LUT322H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT323L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT323H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT324L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT324H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT325L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT325H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT326L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT326H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT327L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT327H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT328L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT328H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT329L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT329H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT330L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT330H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT331L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT331H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT332L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT332H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT333L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT333H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT334L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT334H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT335L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT335H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a7c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT336L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT336H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT337L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT337H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT338L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT338H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1a94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
