modm-ext/data.modm.io/docs/svd/header_stm32u5g9xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>RNG</description>
      <groupName>RNG</groupName>
      <baseAddress>0x420c0800</baseAddress>
      <interrupt>
        <name>RNG</name>
        <description>RNG global interrupt</description>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>RNG control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RNGEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CED</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARDIS</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG3</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NISTC</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNG_CONFIG2</name>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BY_1</name>
                  <description>No clock division</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_2</name>
                  <description>2 RNG clock cycles per internal RNG clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_4</name>
                  <description>4 RNG clock cycles per internal RNG clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_8</name>
                  <description>8 RNG clock cycles per internal RNG clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_16</name>
                  <description>16 RNG clock cycles per internal RNG clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_32</name>
                  <description>32 RNG clock cycles per internal RNG clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_64</name>
                  <description>64 RNG clock cycles per internal RNG clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_128</name>
                  <description>128 RNG clock cycles per internal RNG clock</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_256</name>
                  <description>256 RNG clock cycles per internal RNG clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_512</name>
                  <description>512 RNG clock cycles per internal RNG clock</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_1024</name>
                  <description>1024 RNG clock cycles per internal RNG clock</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_2048</name>
                  <description>2048 RNG clock cycles per internal RNG clock</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_4096</name>
                  <description>4096 RNG clock cycles per internal RNG clock</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_8192</name>
                  <description>8192 RNG clock cycles per internal RNG clock</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_16384</name>
                  <description>16384 RNG clock cycles per internal RNG clock</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BY_32768</name>
                  <description>32768 RNG clock cycles per internal RNG clock</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG_CONFIG1</name>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CONDRST</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CONFIGLOCK</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>RNG status register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DRDY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SECS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIS</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>RNG data register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NSCR</name>
          <description>RNG noise source control register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN_OSC1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC2</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC4</name>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC5</name>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EN_OSC6</name>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTCR</name>
          <description>RNG health test configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HTCFG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
